tutorials/MotionT03/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.00185;

writeControl    runTime;

writeInterval   0.0185;

writeFormat     binary;

writePrecision  12;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.9;

libs
(
    "libturbinesFoam.so"
);

DebugSwitches
{
    crossFlowTurbineALSource 1;
    actuatorLineSource  1;
    actuatorLineElement 1;
    LeishmanBeddoes 1;
    LeishmanBeddoes3G 1;
    LeishmanBeddoesSGC 1;
}

// ************************************************************************* //
